{"bill_number":24029,"ordinance_number":35084,"status":"passed","date_passed":"1915-08-09T00:00:00+00:00","date_filed":"1915-08-09T00:00:00+00:00","date_of_signature":"1915-08-09T00:00:00+00:00","date_introduced":"1915-08-06T00:00:00+00:00","index_terms":["GRADING","ENVIRONMENTAL CLEANUP","DUWAMISH WATERWAY","GEORGETOWN","SOUTH PARK"],"fiscal_note":null,"summary":"An Ordinance providing for the improvement of the property within the following described area, to-wit: Beginning at a point of the Oxbow Peninsula at the intersection of the east margin of the Duwamish Waterway and the north bank of the Duwamish River, which point is near the southwest corner of Lot Twenty-seven (27), Block Thirty (30) of J. R. McLaughlin's Waterfront Addition to the City of Seattle; thence following the meanderings of the Duwamish River or existing dike in and easterly, northerly, westerly and southerly direction to the eat margin of the Duwamish Waterway at a point near the Northeast corner of Lot Nineteen (19), Block Thirty-four (34) of said J. R. McLaughlin's Waterfront Addition; thence south along said east margin of the Duwamish Waterway to the point of beginning, it being the intention to describe all that portion of the Oxbow Peninsula lying east of the Duwamish Waterway, all in The City of Seattle, by filling the same as a sanitary measure to an elevation of two (2) feet above City Datum, except an area within the improvement district and lying between the boundary line thereof and a line drawn parallel therewith and fifty (50) feet therefrom, which area shall be filled to an elevation of three (3) feet above City Datum, together with the bulkheading thereof, or the filling of streets abutting upon said private property with earth to serve as bulkheading for the fill on such private property, all in accordance with Resolution 4731 and 4869 of the City Council of the City of Seattle, creating a local improvement district therefor, and providing for the payment of the cost and expense of such improvement by the mode of special assessments upon property in said district, payable by the mode of \"Payment by Bonds,\" and declaring an emergency.  ","committee":"Streets & Sewers"}