{"bill_number":27462,"ordinance_number":38289,"status":"passed","date_passed":"1918-03-11T00:00:00+00:00","date_filed":"1918-03-18T00:00:00+00:00","date_of_signature":"1918-03-18T00:00:00+00:00","date_introduced":"1918-03-04T00:00:00+00:00","index_terms":["STREET CONSTRUCTION","STREETS","WIDENING","GRADING","LAND ACQUISITION","CONDEMNATION","INTERNATIONAL DISTRICT","DOWNTOWN","NORTH BEACON HILL","BEACON HILL"],"references":"Related: Ord 13320  ","fiscal_note":null,"summary":"An ordinance providing for the laying off, opening, widening, extending and establishing of Dearborn Place, from Dearborn Street as condemned by Ordinance No. 13320, to Lane Street, as platted in Rainier Boulevard Fifth Addition to the City of Seattle, and of Lane Street, from the Southwest margin of the alley as platted in blocks 36 and 37, said Rainier Boulevard fifth Addition, to the east line of Syndicate Addition to the City of Seattle; and of Corwin Place, from Lane Street as extended herein to Dearborn Street as condemned by Ordinance No. 13320; providing for the changing and establishing of curb grades of said Dearborn Place as extended and established herein; of Lane Street, from Rainier Avenue to 12th Avenue South; of Corwin Place as established herein; and of 13th Avenue South, from Lane Street to Dearborn Street as condemned by Ordinance No. 13320; providing for the condemnation, appropriation, taking and damaging of land and other property necessary for the laying off, opening, widening, extending and establishing of the above named places and street, and for the changing and establishing of the grades and grading and regrading of the above named places, street and avenue in conformity with the grades established herein, and for the necessary slopes for cuts and fills upon the property abutting upon said places, street and avenue; and providing that the cost of said improvement shall be paid by special assessment upon the property specially benefited in the manner provided by law.  "}