{"bill_number":117352,"ordinance_number":123812,"status":"passed","date_passed":"2012-01-17T00:00:00+00:00","date_filed":"2012-01-27T00:00:00+00:00","date_of_signature":"2012-01-26T00:00:00+00:00","date_introduced":"2011-11-28T00:00:00+00:00","fiscal_note":"[Fiscal Note to Council Bill](http://clerk.seattle.gov/~public/fnote/117352.htm)[](#h1)[](#h3)117352","summary":"AN ORDINANCE accepting deeds and easements for street, alley, or sidewalk purposes; laying off, opening, widening, extending, and establishing portions of the following rights-of-way: Lenora Street abutting Block 47 and the alley in Block 47, Addition to the City of Seattle as laid out by A.A. Denny (commonly known as A.A. Denny's 6th Addition to the City of Seattle); the alley in Block 8, North Park; the alley in Block 13, Addition to the Town of Seattle as laid off by the Heirs of Sarah A. Bell, Deceased; the alley in Block 26, Second Addition to the Town of Seattle as laid off by the Heirs of Sarah A. Bell, Deceased, (commonly known as Heirs of Sarah A. Bell's Second Addition to the City of Seattle); the alley in Block 1, H.S. Turner and Co's University Add'n to the City of Seattle; 46th Avenue South abutting Lot 20, Speedway Addition to the City of Seattle; the street turn-around in Lots 19 and 20, Speedway Addition to the City of Seattle; the alley in Block 11, D.T. Denny's Waterfront Addition to the City of Seattle; the alley in Lot 12, Supplemental Plat of Block 27 to Bell & Denny's First Addition to the City of Seattle; the alley in Block 1, May Addition to the City of Seattle; the alley in Block \"A\", Greene's Replat of Block 10, Squire Park Add. to the City of Seattle; the sidewalk adjoining Block A, Brooklyn Supplemental Addition to the City of Seattle; the alley in Block 6, Columbia; Stone Avenue North abutting a portion of the SW 1/4 of the SE 1/4, Sec. 19, T26N, R4E, W.M.; the sidewalk adjoining a portion of Stone Avenue North in SW 1/4 of the SE 1/4 , Sec. 19, T26N, R4E, W.M.; the alley in Block 19, Denny-Fuhrman Addition to the City of Seattle; the alley in Block 20, First Addition to that part of the Town of Seattle, laid off by Wm. N. Bell and A.A. Denny (commonly known as Bell & Denny's 1st Addition to the City of Seattle); the alley in Block 8, the Byron Addition to the City of Seattle; the sidewalk adjoining Block 104, Terry's Second Addition to the Town of Seattle; the sidewalk adjoining Blocks 51 and 52, New Rainier Vista; and placing the real property conveyed by said deeds and easements under the jurisdiction of the Seattle Department of Transportation.  ","committee":"Transportation","sponsor":"RASMUSSEN","vote":"8-0 (excused: Licata)","electronic_copy":"[PDF scan of Ordinance No. 123812](/~archives/Ordinances/Ord_123812.pdf)"}