{"bill_number":114931,"ordinance_number":121519,"status":"passed","date_passed":"2004-07-06T00:00:00+00:00","date_filed":"2004-07-16T00:00:00+00:00","date_of_signature":"2004-07-16T00:00:00+00:00","date_introduced":"2004-06-21T00:00:00+00:00","index_terms":["BUILDING CODES"],"references":"Related: Related: C.F. 306756  ","fiscal_note":"[Fiscal Note to Council Bill](http://clerk.seattle.gov/~public/fnote/114931.htm)[](#h1)[](#h3)114931","summary":"AN ORDINANCE relating to Building and Construction Codes: amending Chapter 22.100 of the Seattle Municipal Code, the Seattle Building Code; adopting Chapters 2 through 28, Chapters 31 through 33, and Chapter 35 of the 2003 International Building Code; amending Chapter 2, Definitions; Chapter 3, Use and Occupancy Classification; Chapter 4, Special Detailed Requirements Based on Use and Occupancy; Chapter 5, General Building Heights and Areas; Chapter 6, Types of Construction; Chapter 7, Fire-resistance-rated Construction; Chapter 9, Fire Protection Systems; Chapter 10, Means of Egress; Chapter 11, Accessibility; Chapter 12, Interior Environment; Chapter 13, Energy Efficiency; Chapter 14, Exterior Walls; Chapter 15, Roof Assemblies and Rooftop Structures; Chapter 16, Structural Design; Chapter 17, Structural Tests and Special Inspections; Chapter 18, Soils and Foundations; Chapter 19, Concrete; Chapter 21, Masonry; Chapter 23, Wood; Chapter 25, Gypsum Board and Plaster; Chapter 27, Electrical; Chapter 31, Special Construction; Chapter 32, Encroachments into the Public Right-of-way; Chapter 33, Safeguards During Construction; and Chapter 35, Referenced Standards; and adding a new Chapter 1 related to administration, permitting and enforcement, a new Chapter 29, Plumbing Systems, a new Chapter 30, Elevators and Conveying Systems, and a new Chapter 34, Existing Structures; and repealing the 1997 Seattle Building Code.  ","committee":"Urban Development and Planning","sponsor":"STEINBRUECK","vote":"8-0 (Excused: Drago)","note":"NOTE: Certain mathematical characters and equations do not replicate properly in this electronic version. These can be view in printed versions of the code available at the Department of Planning and Development and in the City Clerk's Office."}