{"bill_number":4501,"ordinance_number":17688,"status":"passed","date_passed":"1908-01-06T00:00:00+00:00","date_filed":"1908-01-09T00:00:00+00:00","date_of_signature":"1908-01-09T00:00:00+00:00","date_introduced":"1907-12-16T00:00:00+00:00","index_terms":["STREET CONSTRUCTION","GRADING","PAVING","SIDEWALKS","WATER MAINS","SOUTHEAST MAGNOLIA","MAGNOLIA","INTERBAY"],"references":"Related: CF 33665  ","fiscal_note":null,"summary":"An Ordinance providing for the improvement of Thorndyke Avenue, beginning at the end of the present grade south of the Grand Boulevard; thence southerly to the south line of West Howe Street, Twenty-eighth Avenue West from the south line of West Galer Street North to the South line of Buena Vista Addition No. 2, Twenty-ninth Avenue West from the south line of West Galer Street north to the north line of Elmore Addition; Thirtieth Avenue West, from the south line of Eaton Street (formerly Sherman Avenue) North to the north line of West Blaine Street (formerly Wheeling Street); Thirty-first Avenue West, from the south line of Eaton Street (formerly Sherman Avenue) North to the south line of West Blaine Street (formerly Wheeling Street); West Galer Street, from the west line of Twenty-ninth Avenue West, east to the line of Lot five (5), Block nine (9), Minor's Addition; Eaton Street (formerly Sherman Avenue), West Garfield Street (formerly Kirk Street) and West Hayes Street (formerly Virginia Street), from the West line of Thirty-first Avenue West east to the west line of Twenty-eight Avenue West; West Blaine Street (formerly Wheeling Street), from the west line of Thirty-first Avenue West east to the west line of Thorndyke Avenue produced; West Howe Street, from the west line of Twenty-ninth Avenue West, east to the west line of Thorndyke Avenue; all streets running east and west width Elmore Addition beginning at the west line of Twenty-ninth Avenue West, east to the west line of Twenty-eighth Avenue West; Plymouth Street, from the east line of Twenty-eighth Avenue West, east to the west line of Thorndyke Avenue; the west one-half of Twenty-eighth Avenue West from the south line of Buena Vista Addition No. 2 north to the south line of Block six (6), Buena Vista Addition No. 2, intending to complete the grading of Twenty-eighth Avenue West as commenced in Buena Vista and Buena Vista Addition No. 2, all in the City of Seattle, by grading, curbing and laying cement side walks and water mains, together with all necessary appurtenances, all in accordance with Majority Petition, being File No.33665  "}