{"bill_number":32069,"ordinance_number":42590,"status":"passed","date_passed":"1921-08-15T00:00:00+00:00","date_filed":"1921-08-17T00:00:00+00:00","date_of_signature":"1921-08-17T00:00:00+00:00","date_introduced":"1921-08-08T00:00:00+00:00","index_terms":["SALES","DUNLAP","RAINIER VALLEY"],"fiscal_note":null,"summary":"An Ordinance providing for the disclaimer by the City of Seattle of any and all right, title and interest in and to that certain tract or parcel of land situated in King County in the State of Washington and bounded and described as follows: Beginning at a point on the west line of Block One (1) of C. D. Hillman's Atlantic City Addition to the City of Seattle which is the intersection of the easterly line of Rainier Avenue as platted in C. D. Hillman's Atlantic City Addition with the easterly line of Fifty-first Avenue South; thence northerly along the west line of said Block 1 to the southwesterly line of Wabash Avenue; thence south 88 44' 01\" west a distance of Eighty and 45/100 (80.45) feet to a point of a curve; thence westerly and southerly along the arc of a curve to the left having a radius of Fifteen (15) feet a distance of Twenty-three and 58/100 (23.58) feet to a point of tangency; thence south 0 07'22\" east along a line Eighty (80) feet easterly from and parallel with the westerly line of Rainier Avenue as established by Ordinance No. 29364 of the City of Seattle, a distance of One Hundred Seventy-five and 83/100 (175.83) feet to a point of a curve; thence southerly along the arc of a curve to the left having a radius of Fifty (50) feet a distance of Thirty-six and 65/100 (36.65) feet to a point of a tangency; thence south 42 07'19\" east a distance of Eighty-four and 89/100 (84.89) feet to a point on the west line of Block 1 of C. D. Hillman's Atlantic City Addition; thence northerly along the west line of said Block 1 a distance of Fifty-nine and 56/100 (59.56) feet to the point of beginning; except that portion of the above description which lines south or the south line of Lot Twenty-three (23) in said Block 1 produced westerly.  ","committee":"Streets & Sewers"}