{"bill_number":32128,"ordinance_number":42637,"status":"passed","date_passed":"1921-09-06T00:00:00+00:00","date_filed":"1921-09-07T00:00:00+00:00","date_of_signature":"1921-09-07T00:00:00+00:00","date_introduced":"1921-08-29T00:00:00+00:00","index_terms":["STREET CONSTRUCTION","STREETS","WIDENING","LAND ACQUISITION","CONDEMNATION","INTERBAY"],"references":"Repealing: Ord 39024  ","fiscal_note":null,"summary":"An Ordinance repealing Ordinance No. 39024 entitled: \"An Ordinance providing for the laying off, opening, widening, extending and establishing of Elliott Avenue North through Block one hundred thirty-four (134), Seattle Tide Lands, and of West Garfield Street, from Elliott Avenue North as extended herein, to the east margin of Smith's Cove Waterway, providing for the changing and establishing of curb grades of Elliott Avenue North as extended herein and West Garfield Street, from 15th Avenue West to the east margin of Smith's Cove Waterway. Providing for the condemnation, appropriation, taking and damaging of land and other property necessary for the laying off, opening, widening, extending and establishing of the above name avenue and street and for the changing and establishing of the curb grades and grading and regrading of the above named avenue and street and approaches thereto in conformity with the grades established herein and for the necessary slopes for cuts and fills upon the property abutting on said avenueand street and approaches thereto and providing that the entire cost of said improvement shall be paid by special assessment upon the property specially benefited in the manner provided by law,\" passed by the City Council on the 16th day of December, 1918, and approved by the Mayor on the 26th day of December, 1918, providing for the dismissal of the action in the Superior Court of the State of Washington in and for King County, based upon said Ordinance and being Cause No. 134588 of said Court, providing for the payment of all taxable costs and making an appropriation for such payment.  ","committee":"Finance and Streets & Sewers"}