{"bill_number":116160,"ordinance_number":122695,"status":"passed","date_passed":"2008-05-27T00:00:00+00:00","date_filed":"2008-05-28T00:00:00+00:00","date_of_signature":"2008-05-27T00:00:00+00:00","date_introduced":"2008-03-24T00:00:00+00:00","index_terms":["RIGHT OF WAY","STREETS","ALLEYS","SIDEWALKS","DEEDS","EASEMENTS"],"fiscal_note":"[Fiscal Note to Council Bill](http://clerk.seattle.gov/~public/fnote/116160.htm)[](#h1)[](#h3)116160","summary":"AN ORDINANCE accepting deeds for street and/or alley purposes and easements for sidewalk purposes; establishing, laying off, and widening portions of the following rights-of way: the alley in Block 37, Addition to the Town of Seattle (commonly known as C.D. Boren's Addition to North Seattle); the alley in Block 48, West Green Lake Addition No. 2 to the City of Seattle; SW Webster Street and 45th Avenue SW; the alley in Block 48, A.A. Denny's 6th Addition to the City of Seattle; the alley in Block 23, Second Addition to the Town of Seattle; NW 42nd Street abutting Government Lot 3, Section 13, Township 25 North, Range 3 East; the alley in Block 16, Licton Springs Park Addition to the City of Seattle; S Barton Street abutting Lot 31, Excelsior Acres Tracts No. 2; the easement for public sidewalk in Tract 111, The Pacific Coast Addition; the alley in Block 7, Licton Springs Park Addition to the City of Seattle; the alley in Block 14, University Park Addition to the City of Seattle; the alley in Block 47, J. H. Nagel's Addition to the City of Seattle; the easement for public sidewalk in Lot 10, Tronstad's Addition to the City of Seattle; the alley in Block 38, D.T. Denny's 3rd Addition to North Seattle; the alley in Block 6, Ross 2nd Addition to the City of Seattle; the alley in Block 7, Pettit's University Addition to the City of Seattle; the alley in Block 2, Pettit's University Addition to the City of Seattle; the alley in Block 1, H.S. Turner Park Addition to the City of Seattle; the alley in Block 2, Weedin's Division of Greenlake Addition to Seattle; and placing the real property conveyed by said deeds and easements under the jurisdiction of the Seattle Department of Transportation (SDOT).  ","committee":"Transportation","sponsor":"DRAGO","electronic_copy":"[PDF scan of Ordinance No. 122695](/~archives/Ordinances/Ord_122695.pdf)"}