{"bill_number":116256,"ordinance_number":122743,"status":"passed","date_passed":"2008-07-21T00:00:00+00:00","date_filed":"2008-07-31T00:00:00+00:00","date_of_signature":"2008-07-30T00:00:00+00:00","date_introduced":"2008-06-30T00:00:00+00:00","index_terms":["RIGHT OF WAY","STREETS","ALLEYS","SIDEWALKS","DEEDS","EASEMENTS"],"fiscal_note":"[Fiscal Note to Council Bill](http://clerk.seattle.gov/~public/fnote/116256.htm)[](#h1)[](#h3)116256","summary":"AN ORDINANCE accepting deeds for street and/or alley purposes and easements for street, alley, and sidewalk purposes; establishing, laying off, and widening portions of the following rights-of way: the alley and sidewalk in Block 69, D.T. Denny's Park Addition to North Seattle; the alley in Block 26, Second Addition to the Town of Seattle; S Rose Street, Plat of Lake Dell; the alley in Block 98, D.T. Denny's 5th Addition to North Seattle; the alley in Block 11, Hillman's Lake Front Addition to the City of Seattle, Division No. 1; S Director Street, Excelsior Acre Tracts No. 2; the alley in Block 1, Gillam's Addition to the City of Seattle; the alley in Block 5, Pettit's University Addition to the City of Seattle; NE 112th Street in Green's Rich Acres, Unrecorded; the alley in Block 47, A.A. Denny's 6th Addition to the City of Seattle; the street abutting Block 65, H.E. Orr Park Division No. 6; 33rd Avenue S in a portion of the southwest quarter of the southwest quarter of Section 22, Township 24 N, Range 4 East, W.M.; 16th Avenue SW in a portion of the east half of the northwest quarter of the northeast quarter of Section 24, Township 24 North, Range 3 East, W.M.; 17th Avenue SW abutting Block 18, Homecroft; the alley in Block 11, Bell & Denny's Addition to the City of Seattle; SW Hudson Street abutting Lot 10, Block 5, Kirkwood; the alley in Block 29, Little City Farms, Division No. 5; the alley in Block A, William N. Bell's 3rd Addition to the City of Seattle; the sidewalk adjoining Block 2, Lester Addition to the City of Seattle; the sidewalk adjoining Lot 7, Block 29, D. T. Denny's 3rd Addition to North Seattle.  ","committee":"Transportation","sponsor":"DRAGO","vote":"7-0 (Excused: Clark, McIver)","electronic_copy":"[PDF scan of Ordinance No. 122743](/~archives/Ordinances/Ord_122743.pdf)"}