{"bill_number":116393,"ordinance_number":122873,"status":"passed","date_passed":"2008-12-08T00:00:00+00:00","date_of_signature":null,"date_introduced":"2008-11-10T00:00:00+00:00","index_terms":["RIGHT OF WAY","STREETS","ALLEYS","SIDEWALKS","DEEDS","EASEMENTS"],"fiscal_note":"[Fiscal Note to Council Bill](http://clerk.seattle.gov/~public/fnote/116393.htm)[](#h1)[](#h3)116393","summary":"AN ORDINANCE accepting deeds for street and/or alley purposes and easements for sidewalk purposes; establishing, laying off, and widening portions of the following rights-of-way: the alley in Block 17, Denny-Fuhrman Addition to the City of Seattle; the alley in Block 97, D.T. Denny's 5th Addition to North Seattle; the alley in Block 2, Sparkman & McLean's 1st Addition to West Seattle; the alley in Block 6, Pettit's University Addition to the City of Seattle; the alley in Block 78, D.T. Denny's Park Addition to North Seattle; the alley in Block 5, University Heights; the alley in Block 19, Hill Tract Addition to the City of Seattle; the alley in Block 158, Gilman Park Addition; Prospect Street and Eastlake Avenue E abutting Block 12, East Park Addition; the alley in Block 27, North Seattle; the alley in Block 36, Bell & Denny's 2nd Addition to the City of Seattle; the alley in Block 72, Terry's First Addition to the Town of Seattle; the alley in Block 54, Terry's First Addition to the Town of Seattle; the sidewalk adjoining Lot 6, Block 16, Walker's Addition to the City of Seattle; the alley in Block 9, Claremont Addition; the alley in Block 1, Scenic Park; the alley in Block 18, H.E. Nelson Addition to the City of Seattle; Bayview Avenue S abutting Block 16, Walker's Addition to the City of Seattle; the alley in Block 54, Terry's First Addition to the Town of Seattle; the sidewalk adjoining a portion of Lot 1, Block 54, Terry's First Addition to the Town of Seattle; and placing the real property conveyed by said deeds and easements under the jurisdiction of the Seattle Department of Transportation (SDOT).  ","committee":"Transportation","sponsor":"DRAGO","vote":"9-0","electronic_copy":"[PDF scan of Ordinance No. 122873](/~archives/Ordinances/Ord_122873.pdf)"}