{"bill_number":116447,"ordinance_number":122930,"status":"passed","date_passed":"2009-03-09T00:00:00+00:00","date_filed":"2009-03-17T00:00:00+00:00","date_of_signature":"2009-03-16T00:00:00+00:00","date_introduced":"2009-02-02T00:00:00+00:00","index_terms":["DEEDS","EASEMENTS","STREETS","SIDEWALKS","ALLEYS","RIGHT OF WAY","DEPARTMENT OF TRANSPORTATION SEATTLE"],"fiscal_note":"[Fiscal Note to Council Bill](http://clerk.seattle.gov/~public/fnote/116447.htm)[](#h1)[](#h3)116447","summary":"AN ORDINANCE accepting deeds for street and/or alley purposes and easements for sidewalk purposes; establishing, laying off, and widening portions of the following rights-of-way: the alley in H. L. Yesler's Donation Claim Numbers 42 and 47; McGraw Street abutting Block 11, Hunter's Lake Union Addition to the City of Seattle; the sidewalk adjoining Block 11, Hunter's Lake Union Addition to the City of Seattle; the alley in Block F, 4th Addition to the City of Seattle; the sidewalk adjoining Block F, 4th Addition to the City of Seattle; the alley in Block 6, Denny-Fuhrman Addition to the City of Seattle; the alley in Block 4, Rainier Boulevard Addition to the City of Seattle; NW 100th Street abutting Block 1, S. F. Barker's Home Addition No. 1; the alley in Block 10, Randell's 2nd Addition to the City of Seattle; the alley in Block 13, Eastern Addition to the Town of Seattle; the alley in Block 17, C. D. Hillman's Atlantic City Addition to the City of Seattle Division No. 2; S Wolcott Street abutting Blocks 17 and 18, C.D. Hillman's Atlantic City Addition to the City of Seattle Division No. 2; the sidewalk adjoining Block 19, Hill Tract Addition to the City of Seattle; the sidewalk adjoining Lot 2, Acre 1, Tract 30, The Maple Leaf Addition to Green Lake Circle; the alley in Block 14, South Park; the alley in Block 8, The Byron Addition to the City of Seattle; Wolcott Avenue South abutting Blocks 17 and 18, C.D. Hillman's Atlantic City Addition to the City of Seattle Division No. 2; the sidewalk adjoining Block 2, Weedin's Division of Greenlake Addition to Seattle; the alley in Block 51, Boston Co.'s Plat of West Seattle; the alley in Block 5, Pettit's University Addition to the City of Seattle.  ","committee":"Transportation","sponsor":"DRAGO","vote":"6-0 (Excused: Burgess, Drago, McIver)","electronic_copy":"[PDF scan of Ordinance No. 122930](/~archives/Ordinances/Ord_122930.pdf)"}