{"bill_number":116599,"ordinance_number":123061,"status":"passed","date_passed":"2009-08-10T00:00:00+00:00","date_filed":"2009-08-17T00:00:00+00:00","date_of_signature":"2009-08-17T00:00:00+00:00","date_introduced":"2009-08-03T00:00:00+00:00","index_terms":["DEEDS","EASEMENTS","SIDEWALKS","ALLEYS","RIGHT OF WAY"],"fiscal_note":"[Fiscal Note to Council Bill](http://clerk.seattle.gov/~public/fnote/116599.htm)[](#h1)[](#h3)116599","summary":"AN ORDINANCE accepting deeds, correction deeds, and easements for street, alley, and sidewalk purposes; laying off, opening, widening, extending, and establishing portions of the following rights-of-way: the alley in Lots 1 and 2, Block 26, of Second Addition to that part of the City of Seattle Laid off by A.A. Denny and W.M. Bell (Commonly known as Bell and Denny's 2nd Addition to the City of Seattle); the alley in Lots 3 through 6, Block 9, an Addition to the Town of Seattle, as laid off by the Heirs of Sarah A. Bell, Deceased (commonly known as Heirs of Sara A. Bell's Addition to the City of Seattle) ; the sidewalk adjoining a portion of Lot 7, Block 9, Compton's 1st Addition to the City of Seattle; the alley in Lots 7 and 8, Block 69, D.T. Denny's Park Addition to North Seattle; the alley in Lots 9 and 10, Block 69, D.T. Denny's Park Addition to North Seattle; the sidewalk adjoining a portion of Lot 7, Block 19, Hill Tract Addition to the City of Seattle; the sidewalk abutting Lot 25, Block 13, Westholme; the alley in Lots 1, 2, and 3, Block 8, Jos. C. Kinnear's Addition to the City of Seattle; the alley in Lots 9 and 10, Block 23, South Park; the sidewalk adjoining portions of Lots 5 and 6, Block 23, Denny and Hoyt's Addition to the City of Seattle; the alley in Lot 4, Block 2, Daniel's University Grove; the alley turn-around in Lots 15 and 16, Block 48, Yesler's 2nd Addition (Supplemental) to the City of Seattle; the alley in Lots 46 and 47, Block 5, Pettit's University Addition; the alley in Lots 10 and 11, Block 9, Lake View Addition to the City of Seattle; the alley in Lots 3 and 4, Block 29, North Seattle; the alley in Lots 19, 20 and 21, Block 9, Lake View Addition to the City of Seattle; the alley in Lots 16, 17,18, and 19, Block 9, Lake View Addition to the City of Seattle; the sidewalk adjoining Lot 7, Block 98, D.T. Denny's 5th Addition to North Seattle; the alley in Lots 14 and 15, Block 9, Latona First Addition to the City of Seattle; the alley in Lots 7 and 8, Block 11, Fairview Homestead Addition For The Benefit of Mechanics and Laborers; and placing the real property conveyed by said deeds and easements under the jurisdiction of the Seattle Department of Transportation.  ","committee":"Transportation","sponsor":"DRAGO","vote":"9-0","electronic_copy":"[PDF scan of Ordinance No. 123061](/~archives/Ordinances/Ord_123061.pdf)"}