{"bill_number":116661,"ordinance_number":123122,"status":"passed","date_passed":"2009-10-05T00:00:00+00:00","date_filed":"2009-10-08T00:00:00+00:00","date_of_signature":"2009-10-08T00:00:00+00:00","date_introduced":"2009-09-21T00:00:00+00:00","index_terms":["DEEDS","EASEMENTS","SIDEWALKS","RIGHT OF WAY","STREETS"],"fiscal_note":"[Fiscal Note to Council Bill](http://clerk.seattle.gov/~public/fnote/116661.htm)[](#h1)[](#h3)116661","summary":"AN ORDINANCE accepting deeds and easements for street, alley, or sidewalk purposes; laying off, opening, widening, extending, and establishing portions of the following rights-of-way: the alley in Lots 4, 5, and 6, Block 85, D.T Denny's Home Addition to the City of Seattle; the sidewalk adjoining Lot 6, Block 85, D.T. Denny's Home Addition to the City of Seattle; the sidewalk adjoining Lot 1, Block 31, Supplemental Plat of Lincoln Pontius Addition to the City of Seattle; the alley in Lot 24, Block 1, Queen Addition to the City of Seattle; the alley in Lots 21 and 22, Block 5, Hillman's Lake Front Addition to the City of Seattle Division No. 1; Western Avenue abutting Lots 1, 2, 3 and 4, Block 10, Portion of the Town of Seattle, as laid out on the Land Claim of Wm. N. Bell, and the North Western Extremity of the Claim of A.A. Denny (Commonly known as Bell & Denny's Addition to the City of Seattle); the alley in Lots 1, 2, 3, and 4, Block 10, Town of Seattle, as laid out on the Land Claim of Wm. N. Bell, and the North Western Extremity of the Claim of A.A. Denny (Commonly known as Bell & Denny's Addition to the City of Seattle); the alley in Lot 5, Block 2, Daniel's University Grove; the alley in Lot 6, Block 50, John H. Nagle's Second Addition to the City of Seattle; the sidewalk adjoining Lot 4 and Tract \"A\", Village Homes at Othello Station Unit Lot Subdivision; the sidewalk adjoining Lot 7, Block 62, D.T. Denny's Home Addition to the City of Seattle; the alley in Lots 9 and 10, Block 4, Francies R. Day's LaGrande; the alley in Lots 28, 29, and 30, Block 2, Elbert Place Addition to the City of Seattle; S. Holgate Street abutting Lots 2 through 10, Block 40, McKinney's Central Seattle; the alley in Lot 5, Block 45, Denny and Hoyt's Addition to the City of Seattle; the sidewalk adjoining Lot 5, Block 11, Woodlawn Addition to Green Lake; the alley in Fractional Lot 6, Block 7, South Park Heights and Fractional Lot 34, Block 48, South Park; the alley in Lot 7, Block 7, South Park Heights; the alley in Lot 8, Block 7, South Park Heights; the alley in Lots 9, 10, 11 and 12, Block 12, Brooklyn Addition to Seattle; placing the real property conveyed by said deeds and easements under the jurisdiction of the Seattle Department of Transportation; and ratifying and confirming certain prior acts.  ","committee":"Transportation","sponsor":"DRAGO","vote":"9-0","electronic_copy":"[PDF scan of Ordinance No. 123122](/~archives/Ordinances/Ord_123122.pdf)"}