{"bill_number":116906,"ordinance_number":123354,"status":"passed","date_passed":"2010-07-19T00:00:00+00:00","date_filed":"2010-07-28T00:00:00+00:00","date_of_signature":"2010-07-28T00:00:00+00:00","date_introduced":"2010-07-06T00:00:00+00:00","index_terms":["DEEDS","EASEMENTS","SIDEWALKS","RIGHT OF WAY","STREETS"],"fiscal_note":"[Fiscal Note to Council Bill](http://clerk.seattle.gov/~public/fnote/116906.htm)[](#h1)[](#h3)116906","summary":"AN ORDINANCE accepting deeds and easements for street, alley, or sidewalk purposes; laying off, opening, widening, extending, and establishing portions of the following rights-of-way: 5th Avenue South and South Cloverdale Street abutting Block 5, South Park; the alley in Block 8, Portion of the Town of Seattle, as laid out on the Land Claim of Wm. H. Bell and the North Western Extremity of the Claim of A.A. Denny (commonly known as Bell & Denny's Addition to the City of Seattle); Airport Way South abutting Government Lot 7; Northwest 85th Street and Mary Avenue Northwest abutting Tract 16, Gilson's Ballard Acre Tracts; the alley in Block 3, Borzone's Addition to the City of Seattle; the alley in Block 7, South Park Heights; the alley in Block 6, Columbia; the public sidewalk abutting Block 304, Seattle Tide Lands; 39th Avenue South abutting Block 2, Herbert S. Upper's Acre Tracts; the alley in Block 9, The Byron Addition to the City of Seattle; the alley in Block 38, D.T. Denny's 3rd Addition to North Seattle; the alley in Block 9, Edgewater Addition to the City of Seattle; the alley in Block 38, Gilman Park; the public alley turn-around in Block 9, Latona First Addition to the City of Seattle; the alley in Block 103, D.T. Denny's First Addition to North Seattle; the public alley turn-around in Block 103, D.T. Denny's First Addition to North Seattle; Republican Street abutting Block 20, Anderson's Addition to Pontius Addition to Seattle; the alley in Block 9, the Byron Addition to the City of Seattle; the alley in Block 45, Denny & Hoyt's Addition to the City of Seattle; the alley in Block 5, University Heights; placing the real property conveyed by said deeds and easements under the jurisdiction of the Seattle Department of Transportation; and ratifying and confirming certain prior acts.  ","committee":"Transportation","sponsor":"RASMUSSEN","vote":"9-0","electronic_copy":"[PDF scan of Ordinance No. 123354](/~archives/Ordinances/Ord_123354.pdf)"}