{"bill_number":23237,"ordinance_number":34391,"status":"passed","date_passed":"1915-03-01T00:00:00+00:00","date_filed":"1915-03-04T00:00:00+00:00","date_of_signature":"1915-03-04T00:00:00+00:00","date_introduced":"1915-02-23T00:00:00+00:00","index_terms":["STREET CONSTRUCTION","WIDENING","STREETS","GEORGETOWN"],"references":"Repealing: Ord 20187  ","fiscal_note":null,"summary":"An Ordinance repealing Ordinance No. 20187, entitled \"An Ordinance providing for the opening, widening and altering of Military Road in the City of Seattle, across the following described property; Beginning at a point on the North line of Bernard Denny's property located in Section Thirty-three (33), Township Twenty-four (24) North, Range Four (4) East, W. M., City of Seattle, said point being distant South nine degrees and Fifty-nine minutes East (S.9'59'E.) one hundred Eighty-seven (187) feet measured from a point on the North line of Section Thirty-three (33), said point being distant one hundred Forty-one (141) feet more or less Easterly, from the intersection of the North line of Section Thirty-three and the center line of the Oregon and Washington Railroad; thence south eighteen degrees and four minutes East (S.18'04'E.) One Hundred Eighty-two (182) feet, more or less, to the south line of Bernard Denny's property; thence westerly along the south line of Bernard Denny's property a distance of Fifty-three (530 feet, more or less, to a point distant easterly One Hundred ten (110) feet measured at right angles from the east boundary of the Columbia and Puget Sound Railway; thence north eighteen degrees and four minutes west (N. 18 04'W.) a distance of one hundred eighty-two (182) feet, more or less, to a point on the north line of Bernard Denny's property; thence easterly along the north lien of Bernard Denny's property fifty-three (53) feet, more or less, to the point of beginning, containing twenty-one hundredths (0.21) acres, more or less, and providing for the taking and damaging of land and other property necessary therefor, and for the ascertainment and payment of the cost compensation to be made for the private property to be taken and damaged for said purpose;\" approved February 19th, 1909 and published February 20th, 1909.  "}