{"bill_number":1344,"ordinance_number":14977,"status":"passed","date_passed":"1906-12-03T00:00:00+00:00","date_filed":"1906-12-07T00:00:00+00:00","date_of_signature":"1906-12-07T00:00:00+00:00","date_introduced":"1906-10-29T00:00:00+00:00","index_terms":["STREET CONSTRUCTION","SIDEWALKS","CROSSWALKS","GRADING","PAVING","FREMONT"],"references":"Related: Res 251  ","fiscal_note":null,"summary":"An Ordinance providing for the improvement of Third Avenue Northwest, from West Kilbourne Street to West Forty-fifth Street; Fourth Avenue Northwest, from West Forty-second Street to West Forty-fifth Street, Fifth Avenue Northwest, from West Forty-second Street to West Forty-fourth Street, Sixth Avenue Northwest, from the Lake Washington Canal to West Forty-fifth Street; West Forty-fifth Street, from Third Avenue Northwest to Sixth Avenue Northwest; West Forty-second Street, from Third Avenue Northwest to Sixth Avenue Northwest; West Forty-third Street, from Third Avenue Northwest to Eighth Avenue Northwest; West Forty-fourth Street, from Third Avenue Northwest to the west line of H. E. Allen's First Addition to the City of Seattle; and West Forty-fourth Street, from Sixth Avenue northwest to the west boundary line of the other City of Seattle; Bright Street, from Fifth Avenue Northwest to west boundary line of the City of Seattle; West Forty-fifth Street, from Third Avenue Northwest to Eighth Avenue Northwest, all in the City of Seattle, by constructing concrete sidewalks and crosswalks thereon, together with all necessary grading and curbing, in accordance with Resolution No. 251 of the City Council of the City of Seattle, and providing for the payment therefor by the mode of \"Payment by Bonds,\" as provided by an act of the Legislature of the State of Washington, entitled \"An act authorizing the issuance and sale of bonds by cities, to pay for local improvements, providing for the payment thereof, and declaring an emergency,\" approved March 14, 1899, and Ordinance No. 5693 of said city, approved December 6, 1899.  "}