{"bill_number":1446,"ordinance_number":14731,"status":"passed","date_passed":"1906-11-19T00:00:00+00:00","date_filed":"1906-11-20T00:00:00+00:00","date_of_signature":"1906-11-20T00:00:00+00:00","date_introduced":"1906-11-12T00:00:00+00:00","index_terms":["STREET CONSTRUCTION","SIDEWALKS","PAVING","DRAINAGE","CROSSWALKS","WALLINGFORD","FREMONT"],"references":"Repealing: Ord 12179  ","fiscal_note":null,"summary":"An Ordinance repealing Ordinance No. 12179, entitled \"An Ordinance providing for the improvement of Wallingford Avenue, from North Thirtieth Street to North Fiftieth Street; Bagley Avenue, from Kilbourne Street to North Forty-first Street; Meridian Avenue, from Ewing Street to North Fortieth Street; Burke Avenue, from North Thirtieth Street to North Fortieth Street; Densmore Avenue, from Ewing Street to North Fortieth Street; Woodlawn Avenue, from the north line of the right-of-way of the Northern Pacific Railway to North Fortieth Street; Ashworth Avenue, from Blewett Street to North Thirty-ninth Street; Interlake Avenue, from Ewing Street to North Thirty-ninth Street; North Thirty-eighth Street, from Woodland Park Avenue to Wallingford Avenue; North Fortieth Street, from Woodlawn Avenue to Latona Avenue; Blewett Street, from the west line of Edgewater Addition to the east line of Ashworth Avenue, as the same is platted north of said Blewett Street; Carr Place, from the south line of North Thirty-eighth Street, as platted in Edgewater Addition, to the north line of North Thirty-eighth Street, as platted in Lake Union Addition; and Ewing Street, from Albion Place to Meridian Avenue, all in the City of Seattle, by constructing wooden sidewalks, with curbs, gutters and crosswalks, in accordance with Resolution No. 399 of the City Council of the City of Seattle, and providing for the payment therefor by the mode of \"Payment by Bonds,\" as provided by an act of the Legislature of the State of Washington entitled \"An act authorizing the issuance and sale of bonds by cities, to pay for local improvements, providing for the payment thereof, and declaring an emergency,\" approved March 14, 1899, and Ordinance No. 5693 of said city, approved December 6, 1899.  "}