{"bill_number":1542,"ordinance_number":14849,"status":"passed","date_passed":"1906-11-26T00:00:00+00:00","date_filed":"1906-11-29T00:00:00+00:00","date_of_signature":"1906-11-29T00:00:00+00:00","date_introduced":"1906-11-19T00:00:00+00:00","index_terms":["STREET CONSTRUCTION","PAVING","DRAINAGE","CROSSWALKS","GRADING","ATLANTIC","CENTRAL AREA","INTERNATIONAL DISTRICT","DOWNTOWN"],"references":"Repealing: Ord 11431  ","fiscal_note":null,"summary":"An Ordinance repealing Ordinance No. 11431, entitled \"An Ordinance providing for the improvement of Main Street, from Twelfth Avenue South to Twenty-first Avenue South, Washington Street, from a point three hundred sixty (360) feet east of Twelfth Avenue South on the south side of Washington Street to Twenty-first Avenue South; Jackson Street and Weller Street, from Twelfth Avenue South to Twenty-first Avenue South; King Street, from Twelfth Avenue South to Twenty-first Avenue South; Lane Street, from Eighteenth Avenue South to Twenty-first Avenue South; Fourteenth Avenue South and Rainier Avenue, from Washington Street to Dearborn Street; Fifteenth Avenue South, from Yesler Way to Washington Street; Sixteenth Avenue South, from Yesler Way to Weller Street; Seventeenth Avenue South, from Yesler Way to Jackson Street; Eighteenth Avenue South, from Yesler Way to Lane Street, and Nineteenth Avenue South, from Yesler Way to Jackson Street, all in the City of Seattle, by grading and regrading the same, and constructing wooden curbs, gutters and crosswalks, and concrete sidewalks, in accordance with Majority Petition, being File No. 24808 of the records of the City Comptroller of the City of Seattle, and providing for the payment therefor by the mode of \"Payment by Bonds,\" as provided by an act of the Legislature of the State of Washington, entitled \"An act authorizing the issuance and sale of bonds by cities, to pay for local improvements, providing for the payment thereof, and declaring an emergency,\" approved March 14, 1899, and Ordinance No. 5693 of said city, approved December 6, 1899.  "}