{"bill_number":26120,"ordinance_number":37461,"status":"passed","date_passed":"1917-06-18T00:00:00+00:00","date_filed":"1917-06-22T00:00:00+00:00","date_of_signature":"1917-06-22T00:00:00+00:00","date_introduced":"1917-01-29T00:00:00+00:00","index_terms":["STREET CONSTRUCTION","STREETS","WIDENING","GRADING","LAND ACQUISITION","CONDEMNATION","UNIVERSITY DISTRICT"],"references":"Repealing: Ord 35822  ","fiscal_note":null,"summary":"An Ordinance repealing Ordinance No. 35822, entitled: \"An Ordinance providing for the laying off, opening, widening, extending and establishing of Eastlake Avenue, from the south lien of Block Twenty-four (24), Lake Union Shore Lands to Tenth Avenue Northeast near its intersection with East Fortieth Street; of East Fortieth Street, from Seventh Avenue Northeast to Tenth Avenue Northeast; and of a public street and highway to be known as East Thirty-ninth Street (being and extension of the unnamed 100-foot street lying just north of Blocks Twenty-four (24) and Twenty-seven (27), Lake Union Shorelands), between Sixth Avenue Northeast and Ninth Avenue Northeast, all in the City of Seattle; providing for the condemnation, appropriation, taking and damaging of land and other property necessary therefor; providing for the changing and establishing of the curb grades on Eastlake Avenue and Eastlake Avenue as extended herein and as produced across Lake Union, from Furhman Avenue to Tenth Avenue Northeast near East Fortieth Street; of East Fortieth Street as widened herein, from Seventh Avenue Northeast to Eleventh Avenue Northeast; of Tenth Avenue Northeast, between East Forty-first Street and East Fortieth Street; of Ninth Avenue Northeast, between East Forty-second Street and East Fortieth Street; of Eighth Avenue Northeast, between East Forty-second Street and East Fortieth Street; and of East Thirty-ninth Street, as extended and established herein; providing for the condemnation, appropriation, taking and damaging of land and other property necessary for the grading and regrading of said streets and avenues in conformity with such established grades, and for cuts and fills upon property abutting upon said streets and avenues; and for the construction and maintenance of elevated roadways or viaducts on Eastlake venue and on East Thirty-ninth Street, as provided herein; and also for the construction and maintenance of a bridge across Lake Union, following the projection of said Eastlake Avenue, in accordance with plans to be prepared by the city engineer; and providing for the payment of the cost of said improvement.\"; authorizing the dismissal of the condemnation proceedings under Cause No. 114874, and appropriating the sum of Four Hundred Twenty and no/100 ($420.00) Dollars, or so much thereof as may be necessary, to pay all taxable costs incurred in said condemnation proceedings under Ordinance No. 35822.  ","committee":"Finance and Streets & Sewers"}