{"bill_number":115886,"ordinance_number":122399,"status":"passed","date_passed":"2007-05-14T00:00:00+00:00","date_filed":"2007-05-23T00:00:00+00:00","date_of_signature":"2007-05-23T00:00:00+00:00","date_introduced":"2007-04-30T00:00:00+00:00","index_terms":["RIGHT OF WAY","STREETS","ALLEYS","SIDEWALKS","DEEDS","EASEMENTS"],"fiscal_note":"[Fiscal Note to Council Bill](http://clerk.seattle.gov/~public/fnote/115886.htm)[](#h1)[](#h3)115886","summary":"AN ORDINANCE accepting deeds for street and/or alley purposes, establishing, laying off, and widening portions of the following rights-of-way: the alley in Block 7, Pettit's University Addition to the City of Seattle; the alley and also the easement for public sidewalk in Block 39, A.A. Denny's 6th Addition to the Town of Seattle; the alley in Block 11, Heirs of Sarah A. Bell's Addition to the City of Seattle; the alley in Block N, Bell's 5th Addition to the City of Seattle; the alley in Block 44, Denny-Fuhrman Addition to the City of Seattle; the alley in Block 15, Eastern Addition to the Town of Seattle; the alley in Block 11, Bell & Denny's Addition to the City of Seattle; the alley in Block 6, Ross 2nd Addition to the City of Seattle; the alley in Block 2, Osner's Suburban Homes; the alley in Block 32, H. L. Yesler's 1st Addition to the City of Seattle; 5th Avenue N.E. in Section 29, Township 26 North, Range 4 East; the alley in Block 5, Sorenson's Addition to the City of Seattle; the alley in Block 4, Stone's Addition to the City of Seattle; the alley in Block 8, Oak Lake Villa Tracts; the alley in Block 41, Denny & Hoyt's Addition to the City of Seattle; the alley in Block 8, North Park Addition to the City of Seattle; the alley in Block 1, Lucas Addition to the City of Seattle; the alley in Block 26, Bell & Denny's 2nd Addition to the City of Seattle; the alley in Block 25, D. T. Denny's Home Addition to the City of Seattle; accepting various easements for sidewalk purposes and placing the real property conveyed by such deeds and easements under the jurisdiction of the Seattle Department of Transportation. (RW T2000-01, RW T2001-15, RW T2000-6a, RW T2000-9, RW T2000-10, RW T2000-12, RW T2000-15, RW T2000-16, RW T2000-17, RW T2000-18, RW T2000-19, RW T2000-20, RW T2000-21, RW T2000-22a, RW T2000-22b, RW T2000-23, RW T2002-01, RW T2002-02, RW T2002-03, RW T2002-04)  ","committee":"Transportation","sponsor":"DRAGO","vote":"7-0 (Excused: Conlin, Drago)","electronic_copy":"[PDF scan of Ordinance No. 122399](/~archives/Ordinances/Ord_122399.pdf)"}