{"bill_number":115925,"ordinance_number":122430,"status":"passed","date_passed":"2007-07-02T00:00:00+00:00","date_filed":"2007-07-09T00:00:00+00:00","date_of_signature":"2007-07-06T00:00:00+00:00","date_introduced":"2007-06-25T00:00:00+00:00","index_terms":["RIGHT OF WAY","STREETS","ALLEYS","SIDEWALKS","DEEDS","EASEMENTS"],"fiscal_note":"[Fiscal Note to Council Bill](http://clerk.seattle.gov/~public/fnote/115925.htm)[](#h1)[](#h3)115925","summary":"AN ORDINANCE accepting deeds for street and/or alley purposes and easements for sidewalk purposes; establishing, laying off, and widening portions of the following described rights-of-way: the alley in Block 36, Addition to the Town of Seattle, as laid out on the Claims of C.D. Boren and A.A. Denny and H.L. Yesler (commonly known as C.D. Boren's Addition to the City of Seattle); the sidewalk in Tract 15, Maple Leaf Addition to Green Lake Circle; the alley in Block 32, Second Addition to that part of the City of Seattle, as laid off by A.A. Denny and W.N. Bell (commonly known as Bell and Denny's 2nd Addition to the City of Seattle); 23rd Avenue SW and SW Myrtle Street in Block 42, Homecroft, an Addition to the City of Seattle; the alley in Block 10, Edgewater Addition to the City of Seattle (two parcels); the alley in Block 15, Plat of Columbia; the alley in Holtfreter's Addition to the City of Seattle; the alley in Block 9, Plat of Columbia; the alley in Block 12, Replat of John J. McGilvra's Third Addition; 30th Avenue S.W. in Block 3, Read's 1st Addition; 30th Avenue S.W. in Block 4, Steel Works Addition to West Seattle; the alley in Block 2, Sparkman and McLean's First Addition to West Seattle; the alley in Block 2, Plat of University Heights; the alley in Block 3, Elbert Place Addition to the City of Seattle; the sidewalk in Block 43, Rainier Boulevard Addition to the City of Seattle; and placing the real property conveyed by said deeds and easements under the jurisdiction of the Seattle Department of Transportation. RW T2005-10, RW T2005-31, RW T2005-39, RW T2005-40, RW T2005-46, RW T2005-52(A), RW T2005-52(B), RW T2005-54, RW T2005-59, RW T2005- 60, RW T2005-61, RW T2005-63, RW T2005-64, RW T2005-67, RW T2005-70, RW T2005-71)  ","committee":"Transportation","sponsor":"DRAGO","vote":"9-0","electronic_copy":"[PDF scan of Ordinance No. 122430](/~archives/Ordinances/Ord_122430.pdf)"}