{"bill_number":115915,"ordinance_number":122419,"status":"passed","date_passed":"2007-06-18T00:00:00+00:00","date_filed":"2007-06-27T00:00:00+00:00","date_of_signature":"2007-06-27T00:00:00+00:00","date_introduced":"2007-06-11T00:00:00+00:00","index_terms":["RIGHT OF WAY","STREETS","ALLEYS","SIDEWALKS","DEEDS","EASEMENTS"],"fiscal_note":"[Fiscal Note to Council Bill](http://clerk.seattle.gov/~public/fnote/115915.htm)[](#h1)[](#h3)115915","summary":"AN ORDINANCE accepting deeds for street and/or alley purposes establishing, laying off, and widening portions of the following rights-of way: the alley in Block 12, Pettit's University Addition to the City of Seattle; the alley in Block 12, Boren & Denny's Addition to the City of Seattle; the alley in Block 17, D. T. Denny's Waterfront Addition to the City of Seattle; the alley in Block 3, Fairview Homestead Association; 36th Avenue West in Government Lot 6 of Section 10, Township 25 north, Range 3 East, W.M.; the alley in Block 5, Pettit's University Addition to the City of Seattle; the alley in Block 10, Bell & Denny's Addition to the City of Seattle; the alley in Block 1, Albert Addition to the City of Seattle; the alley in Block 39, West Green Lake Addition No. 2 to the City of Seattle; the alley in Block 4, Replat of Blocks C & D, Hamblet's Acre Gardens; the easement for public sidewalk in Block 2, Pettit's University Addition to the City of Seattle; the alley in Block 1, Phinney Addition to the City of Seattle; the alley in Block 5, University Addition to the City of Seattle; the alley in Block 6, Interlake Addition to the City of Seattle; and the alley in Block 12, Replat of John J. McGilvra's Third Addition to the City of Seattle; and placing the real property conveyed by such deeds under the jurisdiction of the Seattle Department of Transportation. (RW T2002-05, RW T2002-06, RW T2002-07, RW T2002-10, RW T2002-11, RW T2002-13, RW T2003-01, RW T2003-03, RW T2003-15, RW T2004-05, RW T2004-06, RW T2004-08 (deed and easement), RW T2004-09, RW T2004-13, RW T2004-19; RW T2004-29)  ","committee":"TRANSPORTATION","sponsor":"DRAGO","vote":"9-0","electronic_copy":"[PDF scan of Ordinance No. 122419](/~archives/Ordinances/Ord_122419.pdf)","note":"Right-of-Way Acceptance Ordinance"}