{"bill_number":115942,"ordinance_number":122495,"status":"passed","date_passed":"2007-09-17T00:00:00+00:00","date_filed":"2007-09-27T00:00:00+00:00","date_of_signature":"2007-09-21T00:00:00+00:00","date_introduced":"2007-07-16T00:00:00+00:00","index_terms":["RIGHT OF WAY","STREETS","ALLEYS","SIDEWALKS","DEEDS","EASEMENTS"],"fiscal_note":"[Fiscal Note to Council Bill](http://clerk.seattle.gov/~public/fnote/115942.htm)[](#h1)[](#h3)115942","summary":"AN ORDINANCE accepting deeds for street and/or alley purposes and easements for sidewalk purposes; establishing, laying off, and widening portions of the following rights-of way: the alley in Block 6, Ross Second Addition to the City of Seattle; the alley in Yesler's Donation Claim No. 42; the alley in Block 3, Elbert Place Addition to the City of Seattle; the alley in Block 48, West Green Lake Addition No. 2 to the City of Seattle; the alley in Block E of A.A. Denny's 4th Addition to the City of Seattle; the alley in Block 1, Woodland Park Boulevard Tracts to the City of Seattle; the alley in Block 1, Gatewood Gardens Addition to the City of Seattle; the alley in Block 43, Denny Fuhrman Addition to the City of Seattle; SW Orchard Street abutting Block 7, Steel Plant Addition to the City of Seattle; the alley in Block 3, Witt's Addition to the City of Seattle; the alley in Block H, 4th Addition to the City of Seattle; the easement for public sidewalk in Block 79, Gilman Park Addition to the City of Seattle; the alley in Block 17, Gilman's Addition to the City of Seattle; the alley in Block 26, Second Addition to the Town of Seattle; the alley in Block 96, D.T. Denny's Fifth Addition to North Seattle; S Holly Park Drive in Holly Park Phase III; the alley in Block 9, Holly Park Phase III; S Webster Street in northeast quarter of the southwest quarter of Section 27, Township 24, Range 4 E; the sidewalk in Block 12, Mayfair Addition to the City of Seattle; and placing the real property conveyed by said deeds and easements under the jurisdiction of the Seattle Department of Transportation. (RW T2005-21, RW T2006-04, RW T2006-5A, RW T2006-5B, RW T2006-06, RW T2006-07, RW T2006-09, RW T2006-10; RW T2006-11, RW T2006-12, RW T2006-14, RW T2006-16, RW T2006-20, RW T2006-21, RW T2006-22, RW T2006-24, RW T2006-25A, RW T2006-25B, RW-T2006-25C, RW T2006-28)  ","committee":"Transportation","sponsor":"DRAGO","vote":"9-0","electronic_copy":"[PDF scan of Ordinance No. 122495](/~archives/Ordinances/Ord_122495.pdf)"}